// vue와 react 배경 알아보긔
/* 

프론트엔드 개발 배경
1. 2000년대 웹의 모습
1-1. 정적인 문서 위주의 환경 (HTML + CSS)
1-2. 2004년 Ajax, 2006년 jQuery가 등장 -> 서버에 직접 페이지를 요청하지 않고도 일부만 갱신할 수 있는 동적인 웹 시대
1-3. 애플리케이션의 규모가 커지면 커질수록 DOM 조작이 복잡해지고 유지보수가 어려워지는 문제점이 생김

2. 프레임워크 등장 -> 웹을 개발하기 위한 기본적인 아키텍처가 적용된 프로그램
2-1. Angular (2010년), 구글 개발
2-1-1. JavaScript 기반, MVC(Model-View-Controller) 아키텍처
2-1-2. 양방향 데이터 바인딩, 대규모 웹 애플리케이션에 특화된 설계&기능 제공
2-1-3. 프로젝트 규모가 커질수록 데이터 흐름 추적이 어렵고, 프레임워크가 굉장히 무거운 단점이 있음

2-2. React (2013년), 페이스북(메타)에서 개발
2-2-1. 페이스북은 Angular를 사용해서 개발
2-2-1-1. 페이스북의 뉴스 피드처럼 자주, 부분적으로 갱신되는 초대형 UI에서는 성능 문제가 발생함
2-2-1-2. Angular의 성능 문제를 개선하고자 하는 연구 -> UI를 순수 함수로 만들면 복잡성을 줄이고 성능도 개선할 수 있다고 판단
2-2-2. React의 핵심 아이디어는 UI 렌더링
2-2-2-1. 단방향 데이터 바인딩으로 설계. 데이터 흐름 추적이 쉽고 성능을 향상
2-2-2-2. 가상 돔 (Virtual DOM)
2-2-2-2-1. 스벨트(svelte) 핵심 개발자 중 1명이 컨퍼런스에서 발표
2-2-2-2-2. 가상 돔은 오히려 렌더링 성능을 저하시킨다

2-3. Vue.js (2014년), 구글 개발자 에반 유(Evan You)
2-3-1. 앵귤러 사용하여 프로젝트 진행하면서 문제점을 느낌
2-3-2. 사이드 프로젝트로 진행함
2-3-3. 구글 신규 프로젝트에 Angular 안쓰고 자기가 개발한거 썼는데 동료들의 큰 호응 얻음 => Vue.js 오픈소스로 올림
2-3-4. 어떤 라이브러리나 프레임워크보다도 더 배우기 쉽고 빠르게 웹 애플리케이션을 만드는게 슬로건
2-3-4-1. Angular, React 배우기 쉽게 하면서 빠르게 애플리케이션을 만들게 함
2-3-4-1-1. 가벼움. 가상 DOM. 양방향 데이터 바인딩
2-3-4-1-2. 후발 주자는 선발 주자의 장점을 흡수해서 단점을 보완
2-3-4-1-3. 선발 주자 -> 점유율 확보 (1996 - 2008, 크롬)
2-3-4-2. Vue.js -> Angular와 React의 장점 (양방향 바인딩 + 가상 DOM)


패키지 = 라이브러리 (유의어)
3. npm
3-1. Node Package Manager
3-2. Node.js 패키지를 설치, 관리하는 패키지 매니저

4. npx(npm package excutor, 비표준)
4-1. Npm Package Runner
4-2. npm package 실행
4-3. npx(실행하는 도구) create-react-app(패키지) .(현재폴더)
4-3-1. npx를 사용해서 create-react-app 패키지를 현재 폴더에 실행
4-3-1-1. npx, 로컬과 글로벌 영역에서 실행하려고 하는 패키지가 있는지 확인 -> 있으면 실행
4-3-1-2. 없으면? 서버에서 최신 버전을 임시로 다운로드해서 설치함. -> 삭제(npm v7 캐시에 보관), space sniffer, npm cache

5. Vite (Evan you 개발)
5-1. 차세대 프론트엔드 빌드 도구
5-2. CRA -> 웹팩 + 바벨
5-2-1. 웹팩 -> 모듈 번들러, 바벨 -> 트랜스컴파일러(트랜스파일 + 컴파일)
5-3. Vite
5-3-1. esbuild, rollup
5-3-2. esbuild = 모듈 번들러 + 트랜스컴파일러(개발할 때 빨리 개발하려고 속도 몰빵)
5-3-2-1. Go 언어로 개발. 컴퓨터에게 굉장히 친숙한 언어 (개발환경속도 굿)
5-3-3. rollup (배포를 안정적으로 하기 위해서 개발 후처리에 몰빵)
5-3-3-1. 모듈을 최적화하고, 트리셰이킹 -> esbuild는 부족함

SWC (Speed Web Compiler) , Rust
국내 1인 개발자가 만듦 -> Vercel(Next.js)에서 스카우트
아주 핫한 컴파일러

Vite에서 이미 esbuild를 사용허고 있긴 한데
SWC가 매우 핫해서? @vite/SWC ... 이런식으로 받을 수 있음
단점은 SWC의 최신사양을 받아오지 못함 반영속도가 느림


npm run dev?
npm start, serve, go


1. npm install 패키지명
2. npm install 패키지명 --save
3. npm install 패키지명 -D
4. npm install 패키지명 --save-dev
뒤에 적은건 옵션. 패키지명보다 앞에 와도 됨 (옵션이라)
1, 2는 dependencies에 설치
3, 4는 devDependencies에 설치

public
정적(static) 파일을 보관하는 폴더
빌드 과정에서 번들러의 타겟이 되지 않는 폴더
빌드 과정에서 가공되지않고 그대로 제공되는 폴더

src
애플리케이션이 동작하는데 필요한 소스
모든 소스 코드는 src 하위에 있음

*/
